### Terraform `plan` Succeeded for Workspace: `default`
<details open><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_instance.ansible_server will be created
+   resource "aws_instance" "ansible_server" {
+       ami                                  = "ami-04899f2bb6fbe5884"
+       arn                                  = (known after apply)
+       associate_public_ip_address          = (known after apply)
+       availability_zone                    = (known after apply)
+       cpu_core_count                       = (known after apply)
+       cpu_threads_per_core                 = (known after apply)
+       disable_api_stop                     = (known after apply)
+       disable_api_termination              = (known after apply)
+       ebs_optimized                        = (known after apply)
+       enable_primary_ipv6                  = (known after apply)
+       get_password_data                    = false
+       host_id                              = (known after apply)
+       host_resource_group_arn              = (known after apply)
+       iam_instance_profile                 = (known after apply)
+       id                                   = (known after apply)
+       instance_initiated_shutdown_behavior = (known after apply)
+       instance_lifecycle                   = (known after apply)
+       instance_state                       = (known after apply)
+       instance_type                        = "t3.small"
+       ipv6_address_count                   = (known after apply)
+       ipv6_addresses                       = (known after apply)
+       key_name                             = "ec2"
+       monitoring                           = false
+       outpost_arn                          = (known after apply)
+       password_data                        = (known after apply)
+       placement_group                      = (known after apply)
+       placement_partition_number           = (known after apply)
+       primary_network_interface_id         = (known after apply)
+       private_dns                          = (known after apply)
+       private_ip                           = (known after apply)
+       public_dns                           = (known after apply)
+       public_ip                            = (known after apply)
+       secondary_private_ips                = (known after apply)
+       security_groups                      = (known after apply)
+       spot_instance_request_id             = (known after apply)
+       subnet_id                            = (known after apply)
+       tags                                 = {
+           "Name" = "Ansibleサーバ#1"
        }
+       tags_all                             = {
+           "Name" = "Ansibleサーバ#1"
        }
+       tenancy                              = (known after apply)
+       user_data                            = "f95250cffc0a3e29e46bc665349a1595d38bd5fc"
+       user_data_base64                     = (known after apply)
+       user_data_replace_on_change          = true
+       vpc_security_group_ids               = (known after apply)

+       capacity_reservation_specification {
+           capacity_reservation_preference = (known after apply)

+           capacity_reservation_target {
+               capacity_reservation_id                 = (known after apply)
+               capacity_reservation_resource_group_arn = (known after apply)
            }
        }

+       cpu_options {
+           amd_sev_snp      = (known after apply)
+           core_count       = (known after apply)
+           threads_per_core = (known after apply)
        }

+       ebs_block_device {
+           delete_on_termination = (known after apply)
+           device_name           = (known after apply)
+           encrypted             = (known after apply)
+           iops                  = (known after apply)
+           kms_key_id            = (known after apply)
+           snapshot_id           = (known after apply)
+           tags                  = (known after apply)
+           tags_all              = (known after apply)
+           throughput            = (known after apply)
+           volume_id             = (known after apply)
+           volume_size           = (known after apply)
+           volume_type           = (known after apply)
        }

+       enclave_options {
+           enabled = (known after apply)
        }

+       ephemeral_block_device {
+           device_name  = (known after apply)
+           no_device    = (known after apply)
+           virtual_name = (known after apply)
        }

+       instance_market_options {
+           market_type = (known after apply)

+           spot_options {
+               instance_interruption_behavior = (known after apply)
+               max_price                      = (known after apply)
+               spot_instance_type             = (known after apply)
+               valid_until                    = (known after apply)
            }
        }

+       maintenance_options {
+           auto_recovery = "default"
        }

+       metadata_options {
+           http_endpoint               = (known after apply)
+           http_protocol_ipv6          = (known after apply)
+           http_put_response_hop_limit = (known after apply)
+           http_tokens                 = (known after apply)
+           instance_metadata_tags      = (known after apply)
        }

+       network_interface {
+           delete_on_termination = false
+           device_index          = 0
+           network_card_index    = 0
+           network_interface_id  = (known after apply)
        }

+       private_dns_name_options {
+           enable_resource_name_dns_a_record    = (known after apply)
+           enable_resource_name_dns_aaaa_record = (known after apply)
+           hostname_type                        = (known after apply)
        }

+       root_block_device {
+           delete_on_termination = true
+           device_name           = (known after apply)
+           encrypted             = false
+           iops                  = (known after apply)
+           kms_key_id            = (known after apply)
+           tags_all              = (known after apply)
+           throughput            = 125
+           volume_id             = (known after apply)
+           volume_size           = 30
+           volume_type           = "gp3"
        }
    }

  # aws_internet_gateway.mnigw_01 will be updated in-place
!   resource "aws_internet_gateway" "mnigw_01" {
        id       = "igw-04149ae4fbed83056"
        tags     = {
            "Name" = "mnigw-01"
        }
!       vpc_id   = "vpc-0272ac30f53a8ec22" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_network_interface.ansible_server_nic01 will be created
+   resource "aws_network_interface" "ansible_server_nic01" {
+       arn                       = (known after apply)
+       enable_primary_ipv6       = (known after apply)
+       id                        = (known after apply)
+       interface_type            = (known after apply)
+       ipv4_prefix_count         = (known after apply)
+       ipv4_prefixes             = (known after apply)
+       ipv6_address_count        = (known after apply)
+       ipv6_address_list         = (known after apply)
+       ipv6_address_list_enabled = false
+       ipv6_addresses            = (known after apply)
+       ipv6_prefix_count         = (known after apply)
+       ipv6_prefixes             = (known after apply)
+       mac_address               = (known after apply)
+       outpost_arn               = (known after apply)
+       owner_id                  = (known after apply)
+       private_dns_name          = (known after apply)
+       private_ip                = (known after apply)
+       private_ip_list           = (known after apply)
+       private_ip_list_enabled   = false
+       private_ips               = [
+           "172.18.1.30",
        ]
+       private_ips_count         = (known after apply)
+       security_groups           = (known after apply)
+       source_dest_check         = true
+       subnet_id                 = (known after apply)
+       tags_all                  = (known after apply)

+       attachment {
+           attachment_id = (known after apply)
+           device_index  = (known after apply)
+           instance      = (known after apply)
        }
    }

  # aws_route_table.mnrt_01 will be created
+   resource "aws_route_table" "mnrt_01" {
+       arn              = (known after apply)
+       id               = (known after apply)
+       owner_id         = (known after apply)
+       propagating_vgws = (known after apply)
+       route            = [
+           {
+               carrier_gateway_id         = ""
+               cidr_block                 = "0.0.0.0/0"
+               core_network_arn           = ""
+               destination_prefix_list_id = ""
+               egress_only_gateway_id     = ""
+               gateway_id                 = "igw-04149ae4fbed83056"
+               ipv6_cidr_block            = ""
+               local_gateway_id           = ""
+               nat_gateway_id             = ""
+               network_interface_id       = ""
+               transit_gateway_id         = ""
+               vpc_endpoint_id            = ""
+               vpc_peering_connection_id  = ""
            },
        ]
+       tags             = {
+           "Name" = "mnrt-01"
        }
+       tags_all         = {
+           "Name" = "mnrt-01"
        }
+       vpc_id           = (known after apply)
    }

  # aws_route_table_association.mnrta_01 will be created
+   resource "aws_route_table_association" "mnrta_01" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # aws_security_group.mnsg_01 will be created
+   resource "aws_security_group" "mnsg_01" {
+       arn                    = (known after apply)
+       description            = "mnsg-01"
+       egress                 = [
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               description      = "Outbound - Internet access"
+               from_port        = 0
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "-1"
+               security_groups  = []
+               self             = false
+               to_port          = 0
            },
        ]
+       id                     = (known after apply)
+       ingress                = [
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               description      = "Inbound - Allow all traffic"
+               from_port        = 0
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "-1"
+               security_groups  = []
+               self             = false
+               to_port          = 0
            },
        ]
+       name                   = "mnsg-01"
+       name_prefix            = (known after apply)
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags_all               = (known after apply)
+       vpc_id                 = (known after apply)
    }

  # aws_subnet.subnet_001 will be created
+   resource "aws_subnet" "subnet_001" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = (known after apply)
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "172.18.1.0/26"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = true
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name" = "subnet-001"
        }
+       tags_all                                       = {
+           "Name" = "subnet-001"
        }
+       vpc_id                                         = (known after apply)
    }

  # aws_vpc.mnvpc_01 must be replaced
-/+ resource "aws_vpc" "mnvpc_01" {
!       arn                                  = "arn:aws:ec2:ap-northeast-3:939989362915:vpc/vpc-0272ac30f53a8ec22" -> (known after apply)
-       assign_generated_ipv6_cidr_block     = false -> null
!       cidr_block                           = "10.0.0.0/16" -> "172.18.0.0/16" # forces replacement
!       default_network_acl_id               = "acl-01980b75f629af162" -> (known after apply)
!       default_route_table_id               = "rtb-0fbe7badb8bc2d1fd" -> (known after apply)
!       default_security_group_id            = "sg-0c5b5b5667b096eda" -> (known after apply)
!       dhcp_options_id                      = "dopt-02cbbd2f77866058f" -> (known after apply)
!       enable_dns_hostnames                 = false -> (known after apply)
!       enable_network_address_usage_metrics = false -> (known after apply)
!       id                                   = "vpc-0272ac30f53a8ec22" -> (known after apply)
+       ipv6_association_id                  = (known after apply)
+       ipv6_cidr_block                      = (known after apply)
+       ipv6_cidr_block_network_border_group = (known after apply)
-       ipv6_netmask_length                  = 0 -> null
!       main_route_table_id                  = "rtb-0fbe7badb8bc2d1fd" -> (known after apply)
!       owner_id                             = "939989362915" -> (known after apply)
        tags                                 = {
            "Name" = "mnvpc-01"
        }
        # (3 unchanged attributes hidden)
    }

Plan: 7 to add, 1 to change, 1 to destroy.
```
</details>